import LocalizedStrings from 'react-native-localization';

export const strings = new LocalizedStrings({
  en: {
    'Выберите язык': 'Choose language',
    'Поле электронной почты не может содержать менее 5 символов или содержать пустую строку': 'Email field cannot be less than 5 characters or empty',
    'Поле пароля не может быть меньше 5 символов или содержать пустую строку': 'Password field cannot be less than 5 characters or empty',
    'Пароль недействителен или у пользователя нет пароля!': 'Password is invalid or user has no password!',
    'Нет записи пользователя, соответствующей этому идентификатору. Возможно, пользователь был удален': 'No user record corresponding to this identifier. The user may have been deleted.',
    'Произошла неизвестная ошибка': 'An unknown error occurred',
    'Авторизация': 'Authorization',
    'Электронная почта': 'Email',
    'Пароль': 'Password',
    'Войти': 'Login',
    'У меня нет аккунта': 'I don\'t have an account',
    'Полное имя': 'Full Name',
    'Повторите пароль': 'Confirm Password',
    'Зарегистрироваться': 'Register',
    'Отправить запрос': 'Send Request',
    'Ошибка': 'Error',
    'Ключ': 'Key',

    'Заданий для учетелей': 'Tasks for Teachers',
    'Заданий от админа': 'Tasks from Admin',
    'Тема: ': 'Subject: ',
    'Описание: ': 'Description: ',
    'Статус: ': 'Status: ',
    'Задания': 'Tasks',
    'Кому: ': 'To: ',

    'Тема': 'Subject',
    'Описание': 'Description',

    'Нажать': 'Press',

    'Заявки': 'Requests',
    'Поменять язык': 'Change language',
    'Выйти': 'Logout',
    'Создать пользователя': 'Create user',
    'Создайте пользователю пароль': 'Create password for user',
    'Отмена': 'Cancel',


    'Профиль': 'Profile',

    'Новое задание': 'New task',

    'Заданий для учиников': 'Tasks for students',
    'Заданий от учителя': 'Tasks from teacher',
    'Статус': 'Status',
    'Комментарий': 'Comment',
    'отправить': 'Send',

    'Аудитория': 'Audience',
    'Предмет': 'Subject',
    'Создать':  'Create',

    'Поле имени не должно содержать пустую строку': 'The name field should not be empty',
    'Поле пароль не может быть меньше 5 символов или содержать пустую строку': 'The password field cannot be less than 5 characters or empty',
    'Поле повторите пароль не может быть меньше 5 символов или содержать пустую строку': 'The confirm password field cannot be less than 5 characters or empty',
    'Пароли не подходят': 'Passwords do not match',
    'Этот адрес электронной почты уже используется!': 'This email address is already in use!',
    'Этот адрес электронной почты недействителен!': 'This email address is invalid!',
    'Ни один пользователь не вошел в систему': 'No user has logged in',
    'Поле Тема не должно быть пустым': 'The subject field should not be empty',
    'Поле Описание не должно быть пустым': 'The description field should not be empty',
    'Выбирите кому хотите отправит задачу': 'Select who you want to send the task to',
    'Введите поле': 'Enter the field',

    'Ученики': 'Students',

    'Создано Yeldos Turapbayev': 'Created by Yeldos Turapbayev',


  },
  kz: {
    'Выберите язык': 'Тілді таңдаңыз',
    'Поле электронной почты не может содержать менее 5 символов или содержать пустую строку': 'Электрондық пошта мекенжайы 5 немесе одан кем белгілермен толтырылуы тиіс, немесе бос жол болуы тиіс',
    'Поле пароля не может быть меньше 5 символов или содержать пустую строку': 'Құпия сөз 5 немесе одан кем белгілермен толтырылуы тиіс, немесе бос жол болуы тиіс',
    'Пароль недействителен или у пользователя нет пароля!': 'Құпия сөз жарамсыз немесе пайдаланушыда құпия сөз жоқ!',
    'Нет записи пользователя, соответствующей этому идентификатору. Возможно, пользователь был удален': 'Бұл белгілі белгісіздікті пайдаланушы үшін жазба жоқ. Мүмкін қолданушы жоюға түсіруі керек',
    'Произошла неизвестная ошибка': 'Белгісіз қате туындады',
    'Авторизация': 'Авторизация',
    'Электронная почта': 'Электрондық пошта',
    'Пароль': 'Құпия сөз',
    'Войти': 'Кіру',
    'У меня нет аккунта': 'Мен тіркелген жоқпын',
    'Полное имя': 'Толық аты',
    'Повторите пароль': 'Құпия сөзді қайталаңыз',
    'Зарегистрироваться': 'Тіркелу',
    'Отправить запрос': 'Сұранымды жіберу',
    'Ошибка': 'Қате',
    'Ключ': 'Кілт',

    'Заданий для учетелей': 'Мұғалімнің тапсырмасы',
    'Заданий от админа': 'Меңгерушіден тапсырма',
    'Тема: ': 'Тақырып: ',
    'Описание: ': 'Сипаттама: ',
    'Статус: ': 'Мәртебе: ',
    'Задания': 'Тапсырмалар',
    'Кому: ': 'Кімге: ',

    'Тема': 'Тақырыбы',
    'Описание': 'Сипаттама',

    'Нажать': 'Басу',

    'Заявки': 'Өтінімдер',
    'Поменять язык': 'Тілді ауыстыру',
    'Выйти': 'Шығу',
    'Создать пользователя': 'Пайдаланушыны жасау',
    'Создайте пользователю пароль': 'Пайдаланушыға кілтсөз жасаңыз',
    'Отмена': 'Болдырмау',

    'Профиль': 'Профиль',

    'Новое задание': 'Жаңа тапсырма',

    'Заданий для учиников': 'Оқушыларға тапсырма',
    'Заданий от учителя': 'Мұғалімнең тапсырма',
    'Статус': 'Статус',
    'Комментарий': 'Пікір',
    'отправить': 'Жіберу',

    'Аудитория': 'Аудитория',
    'Предмет': 'Пән',
    'Создать':  'Создать',

    'Поле имени не должно содержать пустую строку': 'Аты өрісі бос болмауы керек',
    'Поле пароль не может быть меньше 5 символов или содержать пустую строку': 'Құпия сөз 5 символдан аз болмауы немесе бос болмауы керек',
    'Поле повторите пароль не может быть меньше 5 символов или содержать пустую строку': 'Құпия сөзді қайталау 5 символдан аз болмауы немесе бос болмауы керек',
    'Пароли не подходят': 'Құпия сөздер сәйкес келмейді',
    'Этот адрес электронной почты уже используется!': 'Бұл электрондық пошта мекенжайы әлі пайдаланылуда!',
    'Этот адрес электронной почты недействителен!': 'Бұл электрондық пошта мекенжайы жарамсыз!',
    'Ни один пользователь не вошел в систему': 'Пайдаланушылардың ешқандай бірі жүйеге кірмеген',
    'Поле Тема не должно быть пустым': 'Тақырып өрісі бос болмауы керек',
    'Поле Описание не должно быть пустым': 'Сипаттама өрісі бос болмауы керек',
    'Выбирите кому хотите отправит задачу': 'Тапсырманы жіберу келетін адамды таңдаңыз',
    'Введите поле': 'Өрісін енгізіңіз',
    
    'Ученики': 'Оқушылар',

    'Создано Yeldos Turapbayev': 'Құрған Yeldos Turapbayev',

  },
  ru: {
    'Выберите язык': 'Выберите язык',
    'Поле электронной почты не может содержать менее 5 символов или содержать пустую строку': 'Поле электронной почты не может содержать менее 5 символов или содержать пустую строку',
    'Поле пароля не может быть меньше 5 символов или содержать пустую строку': 'Поле пароля не может быть меньше 5 символов или содержать пустую строку',
    'Пароль недействителен или у пользователя нет пароля!': 'Пароль недействителен или у пользователя нет пароля!',
    'Нет записи пользователя, соответствующей этому идентификатору. Возможно, пользователь был удален': 'Нет записи пользователя, соответствующей этому идентификатору. Возможно, пользователь был удален',
    'Произошла неизвестная ошибка': 'Произошла неизвестная ошибка',
    'Авторизация': 'Авторизация',
    'Электронная почта': 'Электронная почта',
    'Пароль': 'Пароль',
    'Войти': 'Войти',
    'У меня нет аккунта': 'У меня нет аккунта',
    'Полное имя': 'Полное имя',
    'Повторите пароль': 'Повторите пароль',
    'Зарегистрироваться': 'Зарегистрироваться',
    'Отправить запрос': 'Отправить запрос',
    'Ошибка': 'Ошибка',
    'Ключ': 'Ключ',

    'Заданий для учетелей': 'Заданий для учетелей',
    'Заданий от админа': 'Заданий от админа',
    'Тема: ': 'Тема: ',
    'Описание: ': 'Описание: ',
    'Статус:   ': 'Статус:   ',
    'Задания': 'Задания',
    'Кому: ': 'Кому: ',

    'Тема': 'Тема',
    'Описание': 'Описание',

    'Нажать': 'Нажать',

    'Заявки': 'Заявки',
    'Поменять язык': 'Поменять язык',
    'Выйти': 'Выйти',
    'Создать пользователя': 'Создать пользователя',
    'Создайте пользователю пароль': 'Создайте пользователю пароль',
    'Отмена': 'Отмена',

    'Профиль': 'Профиль',

    'Новое задание': 'Новое задание',

    'Заданий для учиников': 'Заданий для учиников',
    'Заданий от учителя': 'Заданий от учителя,',
    'Статус': 'Статус',
    'Комментарий': 'Комментарий',
    'отправить': 'отправить',

    'Аудитория': 'Аудитория',
    'Предмет': 'Предмет',
    'Создать':  'Создать',

    'Поле имени не должно содержать пустую строку': 'Поле имени не должно содержать пустую строку',
    'Поле пароль не может быть меньше 5 символов или содержать пустую строку': 'Поле пароль не может быть меньше 5 символов или содержать пустую строку',
    'Поле повторите пароль не может быть меньше 5 символов или содержать пустую строку': 'Поле повторите пароль не может быть меньше 5 символов или содержать пустую строку',
    'Пароли не подходят': 'Пароли не подходят',
    'Этот адрес электронной почты уже используется!': 'Этот адрес электронной почты уже используется!',
    'Этот адрес электронной почты недействителен!': 'Этот адрес электронной почты недействителен!',
    'Ни один пользователь не вошел в систему': 'Ни один пользователь не вошел в систему',
    'Поле Тема не должно быть пустым': 'Поле Тема не должно быть пустым',
    'Поле Описание не должно быть пустым': 'Поле Описание не должно быть пустым',
    'Выбирите кому хотите отправит задачу': 'Выбирите кому хотите отправит задачу',
    'Введите поле': 'Введите поле',

    'Ученики': 'Ученики',

    'Создано Yeldos Turapbayev': 'Создано Yeldos Turapbayev',



  },
});
